Catalogs/упПравилаСвязиТиповГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаСвязиТиповГрузов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Связи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновнойТипГруза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимыйТипГруза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упПравилаСвязиТиповГрузов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		Для Каждого Строка1 Из Связи Цикл
			Для Каждого Строка2 Из Связи Цикл
				Если Истина
					И Строка1.ЗависимыйТипГруза = Строка2.ОсновнойТипГруза
					И Строка1.ОсновнойТипГруза = Строка2.ЗависимыйТипГруза
				Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(СтрШаблон("ru='Нельзя добавлять зеркальные пары типов в связи (%1 -> %2)'", Строка1.ОсновнойТипГруза, Строка1.ЗависимыйТипГруза)),
						Ссылка,,, Отказ);
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
